#+TITLE: Berka
#+AUTHOR: Adolfo De Unánue
#+EMAIL: unanue@itam.mx
#+PROPERTY:  header-args:sql :engine postgresql :dbhost 0.0.0.0 :dbport '5555' :dbuser berka :database berka :dbpassword some_password :cmdline -q

*** sqlite
Para jugar con estos datos usaremos una base de datos =sqlite= a la
que llamaremos =berka.db=

Activamos el modo =csv= en =sqlite=.

#+begin_src  sqlite :db berka.db :dir ~/tmp/berka
.mode csv
#+end_src

#+RESULTS:

Esto le indica al cliente de =sqlite= que interprete el archivo de
entrada como un  archivo csv.

Luego de descomprimir el archivo =data_berka.zip=, podemos usar =head=
en uno de los archivos para ver su contenido:

#+begin_src shell :dir ~/tmp/berka :results org
head account.asc
#+end_src

#+RESULTS:
#+begin_src org
"account_id";"district_id";"frequency";"date"
576;55;"POPLATEK MESICNE";930101
3818;74;"POPLATEK MESICNE";930101
704;55;"POPLATEK MESICNE";930101
2378;16;"POPLATEK MESICNE";930101
2632;24;"POPLATEK MESICNE";930102
1972;77;"POPLATEK MESICNE";930102
1539;1;"POPLATEK PO OBRATU";930103
793;47;"POPLATEK MESICNE";930103
2484;74;"POPLATEK MESICNE";930103
#+end_src

Los archivos tienen como separador =";"=. Debemos indicarle esa
información a =sqlite=

#+begin_src sqlite :db berka.db :dir ~/tmp/berka
.separator ";"
#+end_src

#+RESULTS:

Acto seguido importemos el archivo =client.asc=. Nota que lo estoy
guardando a una tabla llamada =clients=, si en plural.

#+begin_src sqlite :db berka.db :dir ~/tmp/berka
.import client.asc clients
#+end_src

#+RESULTS:

Podemos ver que la tabla está ahí con el comando =.tables=

#+begin_src sqlite :db berka.db :dir ~/tmp/berka
.tables
#+end_src

#+RESULTS:
: clients

Y su esquema con =.schema=

#+begin_src sqlite  :db berka.db :dir ~/tmp/berka :results org
.schema clients
#+end_src

#+RESULTS:
#+begin_src org
CREATE TABLE clients(
  "client_id"";""birth_number"";""district_id" TEXT
);
#+end_src


:EXERCISE:
#+begin_exercise
Importa las tablas restantes
#+end_exercise
:END:

:TEACHERONLY:

#+begin_src shell :dir ~/tmp/berka
for table in *.asc
do
    echo "Importing ${table}"
    sqlite3 -separator ";" -cmd ".import ${table} ${table%.*}s" berka.db
done
#+end_src

#+RESULTS:
| Importing | account.asc  |
| Importing | card.asc     |
| Importing | client.asc   |
| Importing | disp.asc     |
| Importing | district.asc |
| Importing | loan.asc     |
| Importing | order.asc    |
| Importing | trans.asc    |

#+begin_src sqlite :db berka.db :dir ~/tmp/berka
.tables
#+end_src

#+RESULTS:
| accounts   clients    districts  orders |
| cards      disps      loans      transs |

:END:

* Labels, cohorts, features
#+begin_src sql :tangle no
select
max(date), min(date),
age(max(date), min(date)) as time_span
from semantic.events;
#+end_src

#+RESULTS:
|        max |        min | time_span                  |
|------------+------------+---------------------------|
| 1998-12-31 | 1993-01-01 | @ 5 years 11 mons 30 days |

**  as of date
#+begin_src sql
select
 generate_series(min(date), max(date), '6 month') as as_of_date
from
semantic.events;
#+end_src

#+RESULTS:
| as_of_date               |
|------------------------|
| 1993-01-01 00:00:00+00 |
| 1993-07-01 00:00:00+00 |
| 1994-01-01 00:00:00+00 |
| 1994-07-01 00:00:00+00 |
| 1995-01-01 00:00:00+00 |
| 1995-07-01 00:00:00+00 |
| 1996-01-01 00:00:00+00 |
| 1996-07-01 00:00:00+00 |
| 1997-01-01 00:00:00+00 |
| 1997-07-01 00:00:00+00 |
| 1998-01-01 00:00:00+00 |
| 1998-07-01 00:00:00+00 |

** Cohort
:PROPERTIES:
:ID:       479a5387-afee-4a9f-8b6f-8f59076990b7
:END:

Definiremos como clientes /nuevos/ aquellos que tienen menos de un año
de haber abierto su cuenta,

#+begin_src sql :tangle sql/cohort_new_clients.sql

drop schema if exists cohorts;
create schema if not exists cohorts;

drop table if exists cohorts.new_clients;
create table if not exists cohorts.new_clients as (
with as_of_dates as (
  select
    generate_series(min(date), max(date), '6 month') as as_of_date
    from
        semantic.events
),

  new_clients as (
    select
      client,
      gender,
      bod,
      district,
      since,
      aod.as_of_date::date,
      daterange(
        (aod.as_of_date - interval '1 year')::date,
        aod.as_of_date::date)
        @> since as "new?"
      from  (
        select
          as_of_date
          from
              as_of_dates
      ) as aod
              left join lateral (
                select *, age(since, as_of_date)
                  from semantic.entities
              ) as t2 on true
  )

select
  -- as_of_date, count(*)
  *
  from
      new_clients
 where "new?" is true
 -- group by 1
)
#+end_src

#+RESULTS:
|   |

** Outcome

El /outcome/ es el resultado de un evento: ¿Los clientes reciben un préstamo?

#+begin_src sql
select
client,
date as event_date,
type = 'loan granted' as outcome
from
semantic.events
limit 10
#+end_src

#+RESULTS:
| client |  event_date | outcome |
|--------+------------+---------|
|      1 | 1995-03-24 | f       |
|      1 | 1995-04-30 | f       |
|      1 | 1995-05-31 | f       |
|      1 | 1995-06-30 | f       |
|      1 | 1995-07-31 | f       |
|      1 | 1995-08-31 | f       |
|      1 | 1995-09-30 | f       |
|      1 | 1995-10-31 | f       |
|      1 | 1995-11-30 | f       |
|      1 | 1995-12-31 | f       |

*** Agregated to =as_of_date=
:PROPERTIES:
:ID:       cf017aa8-21d0-4d32-9fe0-42d8dd264a2d
:END:

#+begin_src sql :tangle sql/features_aggregated.sql :results none
create schema if not exists features;

drop table if exists features.aggregated;

create table if not exists features.aggregated as (
select * from
(
  select
    as_of_date,
    client
    from
        labels.loan_granted_3m
) as aod
             left join lateral ( -- for loop
               select
                 count(*) filter(where daterange((aod.as_of_date - interval '1 month')::date, aod.as_of_date::date) @> date) as "COUNT(*, @1M)",
                 count(*) filter(where daterange((aod.as_of_date - interval '3 month')::date, aod.as_of_date::date) @> date) as "COUNT(*, @3M)",
                 count(*) filter(where daterange((aod.as_of_date - interval '1 month')::date, aod.as_of_date::date) @> date and type='withdrawal in cash')  as "COUNT(withdrawal in cash, @1M)",
count(*) as "COUNT(*)"
                 from semantic.events
                where aod.client = client
             ) as t2
                 on true
);
create index features_aggregated_as_of_date_ix on features.aggregated(as_of_date);
create index features_aggregated_client_ix on features.aggregated(client);
create index features_aggregated_client_as_of_date_ix on features.aggregated(client, as_of_date);
#+end_src

#+RESULTS:
|   as_of_date | client | COUNT(*, @1M) | COUNT(*, @3M) | COUNT(withdrawal in cash, @1M) | COUNT(*) |
|------------+--------+---------------+---------------+--------------------------------+----------|
| 1993-07-01 |      2 |             3 |             9 |                              1 |      476 |
| 1993-07-01 |      3 |             3 |             9 |                              1 |      476 |
| 1993-07-01 |     12 |             5 |            13 |                              1 |      355 |
| 1993-07-01 |     24 |             1 |             3 |                              0 |      323 |
| 1993-07-01 |     29 |             3 |             5 |                              1 |      366 |
| 1993-07-01 |     52 |             1 |             3 |                              0 |      316 |
| 1993-07-01 |     72 |             1 |             3 |                              0 |      357 |
| 1993-07-01 |     98 |             3 |             8 |                              1 |      428 |
| 1993-07-01 |     99 |             3 |             8 |                              1 |      428 |
| 1993-07-01 |    102 |             2 |             6 |                              0 |      405 |
